MikroElektronika/core_packages/PIC/XC8/def/pic/PIC16F13255/mcu.h
// Register: CLBCLK
#define CLBCLK CLBCLK
extern volatile unsigned char           CLBCLK              __at(0x515);
#ifndef _LIB_BUILD
asm("CLBCLK equ 0515h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLK                    :8;
    };
    struct {
        unsigned CLK0                   :1;
        unsigned CLK1                   :1;
        unsigned CLK2                   :1;
        unsigned CLK3                   :1;
        unsigned CLK4                   :1;
        unsigned CLK5                   :1;
        unsigned CLK6                   :1;
        unsigned CLK7                   :1;
    };
} CLBCLKbits_t;
extern volatile CLBCLKbits_t CLBCLKbits __at(0x515);
// bitfield macros
#define _CLBCLK_CLK_POSN                                    0x0
#define _CLBCLK_CLK_POSITION                                0x0
#define _CLBCLK_CLK_SIZE                                    0x8
#define _CLBCLK_CLK_LENGTH                                  0x8
#define _CLBCLK_CLK_MASK                                    0xFF
#define _CLBCLK_CLK0_POSN                                   0x0
#define _CLBCLK_CLK0_POSITION                               0x0
#define _CLBCLK_CLK0_SIZE                                   0x1
#define _CLBCLK_CLK0_LENGTH                                 0x1
#define _CLBCLK_CLK0_MASK                                   0x1
#define _CLBCLK_CLK1_POSN                                   0x1
#define _CLBCLK_CLK1_POSITION                               0x1
#define _CLBCLK_CLK1_SIZE                                   0x1
#define _CLBCLK_CLK1_LENGTH                                 0x1
#define _CLBCLK_CLK1_MASK                                   0x2
#define _CLBCLK_CLK2_POSN                                   0x2
#define _CLBCLK_CLK2_POSITION                               0x2
#define _CLBCLK_CLK2_SIZE                                   0x1
#define _CLBCLK_CLK2_LENGTH                                 0x1
#define _CLBCLK_CLK2_MASK                                   0x4
#define _CLBCLK_CLK3_POSN                                   0x3
#define _CLBCLK_CLK3_POSITION                               0x3
#define _CLBCLK_CLK3_SIZE                                   0x1
#define _CLBCLK_CLK3_LENGTH                                 0x1
#define _CLBCLK_CLK3_MASK                                   0x8
#define _CLBCLK_CLK4_POSN                                   0x4
#define _CLBCLK_CLK4_POSITION                               0x4
#define _CLBCLK_CLK4_SIZE                                   0x1
#define _CLBCLK_CLK4_LENGTH                                 0x1
#define _CLBCLK_CLK4_MASK                                   0x10
#define _CLBCLK_CLK5_POSN                                   0x5
#define _CLBCLK_CLK5_POSITION                               0x5
#define _CLBCLK_CLK5_SIZE                                   0x1
#define _CLBCLK_CLK5_LENGTH                                 0x1
#define _CLBCLK_CLK5_MASK                                   0x20
#define _CLBCLK_CLK6_POSN                                   0x6
#define _CLBCLK_CLK6_POSITION                               0x6
#define _CLBCLK_CLK6_SIZE                                   0x1
#define _CLBCLK_CLK6_LENGTH                                 0x1
#define _CLBCLK_CLK6_MASK                                   0x40
#define _CLBCLK_CLK7_POSN                                   0x7
#define _CLBCLK_CLK7_POSITION                               0x7
#define _CLBCLK_CLK7_SIZE                                   0x1
#define _CLBCLK_CLK7_LENGTH                                 0x1
#define _CLBCLK_CLK7_MASK                                   0x80

// Register: CLBSWOUTH
#define CLBSWOUTH CLBSWOUTH
extern volatile unsigned char           CLBSWOUTH           __at(0x516);
#ifndef _LIB_BUILD
asm("CLBSWOUTH equ 0516h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLBSWOUTH              :8;
    };
    struct {
        unsigned CLBSWOUT8              :1;
        unsigned CLBSWOUT9              :1;
        unsigned CLBSWOUT10             :1;
        unsigned CLBSWOUT11             :1;
        unsigned CLBSWOUT12             :1;
        unsigned CLBSWOUT13             :1;
        unsigned CLBSWOUT14             :1;
        unsigned CLBSWOUT15             :1;
    };
} CLBSWOUTHbits_t;
extern volatile CLBSWOUTHbits_t CLBSWOUTHbits __at(0x516);
// bitfield macros
#define _CLBSWOUTH_CLBSWOUTH_POSN                           0x0
#define _CLBSWOUTH_CLBSWOUTH_POSITION                       0x0
#define _CLBSWOUTH_CLBSWOUTH_SIZE                           0x8
#define _CLBSWOUTH_CLBSWOUTH_LENGTH                         0x8
#define _CLBSWOUTH_CLBSWOUTH_MASK                           0xFF
#define _CLBSWOUTH_CLBSWOUT8_POSN                           0x0
#define _CLBSWOUTH_CLBSWOUT8_POSITION                       0x0
#define _CLBSWOUTH_CLBSWOUT8_SIZE                           0x1
#define _CLBSWOUTH_CLBSWOUT8_LENGTH                         0x1
#define _CLBSWOUTH_CLBSWOUT8_MASK                           0x1
#define _CLBSWOUTH_CLBSWOUT9_POSN                           0x1
#define _CLBSWOUTH_CLBSWOUT9_POSITION                       0x1
#define _CLBSWOUTH_CLBSWOUT9_SIZE                           0x1
#define _CLBSWOUTH_CLBSWOUT9_LENGTH                         0x1
#define _CLBSWOUTH_CLBSWOUT9_MASK                           0x2
#define _CLBSWOUTH_CLBSWOUT10_POSN                          0x2
#define _CLBSWOUTH_CLBSWOUT10_POSITION                      0x2
#define _CLBSWOUTH_CLBSWOUT10_SIZE                          0x1
#define _CLBSWOUTH_CLBSWOUT10_LENGTH                        0x1
#define _CLBSWOUTH_CLBSWOUT10_MASK                          0x4
#define _CLBSWOUTH_CLBSWOUT11_POSN                          0x3
#define _CLBSWOUTH_CLBSWOUT11_POSITION                      0x3
#define _CLBSWOUTH_CLBSWOUT11_SIZE                          0x1
#define _CLBSWOUTH_CLBSWOUT11_LENGTH                        0x1
#define _CLBSWOUTH_CLBSWOUT11_MASK                          0x8
#define _CLBSWOUTH_CLBSWOUT12_POSN                          0x4
#define _CLBSWOUTH_CLBSWOUT12_POSITION                      0x4
#define _CLBSWOUTH_CLBSWOUT12_SIZE                          0x1
#define _CLBSWOUTH_CLBSWOUT12_LENGTH                        0x1
#define _CLBSWOUTH_CLBSWOUT12_MASK                          0x10
#define _CLBSWOUTH_CLBSWOUT13_POSN                          0x5
#define _CLBSWOUTH_CLBSWOUT13_POSITION                      0x5
#define _CLBSWOUTH_CLBSWOUT13_SIZE                          0x1
#define _CLBSWOUTH_CLBSWOUT13_LENGTH                        0x1
#define _CLBSWOUTH_CLBSWOUT13_MASK                          0x20
#define _CLBSWOUTH_CLBSWOUT14_POSN                          0x6
#define _CLBSWOUTH_CLBSWOUT14_POSITION                      0x6
#define _CLBSWOUTH_CLBSWOUT14_SIZE                          0x1
#define _CLBSWOUTH_CLBSWOUT14_LENGTH                        0x1
#define _CLBSWOUTH_CLBSWOUT14_MASK                          0x40
#define _CLBSWOUTH_CLBSWOUT15_POSN                          0x7
#define _CLBSWOUTH_CLBSWOUT15_POSITION                      0x7
#define _CLBSWOUTH_CLBSWOUT15_SIZE                          0x1
#define _CLBSWOUTH_CLBSWOUT15_LENGTH                        0x1
#define _CLBSWOUTH_CLBSWOUT15_MASK                          0x80

// Register: CLBSWOUTL
#define CLBSWOUTL CLBSWOUTL
extern volatile unsigned char           CLBSWOUTL           __at(0x517);
#ifndef _LIB_BUILD
asm("CLBSWOUTL equ 0517h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLBSWOUTL              :8;
    };
    struct {
        unsigned CLBSWOUT0              :1;
        unsigned CLBSWOUT1              :1;
        unsigned CLBSWOUT2              :1;
        unsigned CLBSWOUT3              :1;
        unsigned CLBSWOUT4              :1;
        unsigned CLBSWOUT5              :1;
        unsigned CLBSWOUT6              :1;
        unsigned CLBSWOUT7              :1;
    };
} CLBSWOUTLbits_t;
