MikroElektronika/core_packages/PIC/XC8/def/pic/PIC16F13255/mcu.h
extern volatile CLBSWOUTLbits_t CLBSWOUTLbits __at(0x517);
// bitfield macros
#define _CLBSWOUTL_CLBSWOUTL_POSN                           0x0
#define _CLBSWOUTL_CLBSWOUTL_POSITION                       0x0
#define _CLBSWOUTL_CLBSWOUTL_SIZE                           0x8
#define _CLBSWOUTL_CLBSWOUTL_LENGTH                         0x8
#define _CLBSWOUTL_CLBSWOUTL_MASK                           0xFF
#define _CLBSWOUTL_CLBSWOUT0_POSN                           0x0
#define _CLBSWOUTL_CLBSWOUT0_POSITION                       0x0
#define _CLBSWOUTL_CLBSWOUT0_SIZE                           0x1
#define _CLBSWOUTL_CLBSWOUT0_LENGTH                         0x1
#define _CLBSWOUTL_CLBSWOUT0_MASK                           0x1
#define _CLBSWOUTL_CLBSWOUT1_POSN                           0x1
#define _CLBSWOUTL_CLBSWOUT1_POSITION                       0x1
#define _CLBSWOUTL_CLBSWOUT1_SIZE                           0x1
#define _CLBSWOUTL_CLBSWOUT1_LENGTH                         0x1
#define _CLBSWOUTL_CLBSWOUT1_MASK                           0x2
#define _CLBSWOUTL_CLBSWOUT2_POSN                           0x2
#define _CLBSWOUTL_CLBSWOUT2_POSITION                       0x2
#define _CLBSWOUTL_CLBSWOUT2_SIZE                           0x1
#define _CLBSWOUTL_CLBSWOUT2_LENGTH                         0x1
#define _CLBSWOUTL_CLBSWOUT2_MASK                           0x4
#define _CLBSWOUTL_CLBSWOUT3_POSN                           0x3
#define _CLBSWOUTL_CLBSWOUT3_POSITION                       0x3
#define _CLBSWOUTL_CLBSWOUT3_SIZE                           0x1
#define _CLBSWOUTL_CLBSWOUT3_LENGTH                         0x1
#define _CLBSWOUTL_CLBSWOUT3_MASK                           0x8
#define _CLBSWOUTL_CLBSWOUT4_POSN                           0x4
#define _CLBSWOUTL_CLBSWOUT4_POSITION                       0x4
#define _CLBSWOUTL_CLBSWOUT4_SIZE                           0x1
#define _CLBSWOUTL_CLBSWOUT4_LENGTH                         0x1
#define _CLBSWOUTL_CLBSWOUT4_MASK                           0x10
#define _CLBSWOUTL_CLBSWOUT5_POSN                           0x5
#define _CLBSWOUTL_CLBSWOUT5_POSITION                       0x5
#define _CLBSWOUTL_CLBSWOUT5_SIZE                           0x1
#define _CLBSWOUTL_CLBSWOUT5_LENGTH                         0x1
#define _CLBSWOUTL_CLBSWOUT5_MASK                           0x20
#define _CLBSWOUTL_CLBSWOUT6_POSN                           0x6
#define _CLBSWOUTL_CLBSWOUT6_POSITION                       0x6
#define _CLBSWOUTL_CLBSWOUT6_SIZE                           0x1
#define _CLBSWOUTL_CLBSWOUT6_LENGTH                         0x1
#define _CLBSWOUTL_CLBSWOUT6_MASK                           0x40
#define _CLBSWOUTL_CLBSWOUT7_POSN                           0x7
#define _CLBSWOUTL_CLBSWOUT7_POSITION                       0x7
#define _CLBSWOUTL_CLBSWOUT7_SIZE                           0x1
#define _CLBSWOUTL_CLBSWOUT7_LENGTH                         0x1
#define _CLBSWOUTL_CLBSWOUT7_MASK                           0x80

// Register: CLBDEBUG0
#define CLBDEBUG0 CLBDEBUG0
extern volatile unsigned char           CLBDEBUG0           __at(0x518);
#ifndef _LIB_BUILD
asm("CLBDEBUG0 equ 0518h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DBG                    :8;
    };
    struct {
        unsigned DBG0                   :1;
        unsigned DBG1                   :1;
        unsigned DBG2                   :1;
        unsigned DBG3                   :1;
        unsigned DBG4                   :1;
    };
} CLBDEBUG0bits_t;
extern volatile CLBDEBUG0bits_t CLBDEBUG0bits __at(0x518);
// bitfield macros
#define _CLBDEBUG0_DBG_POSN                                 0x0
#define _CLBDEBUG0_DBG_POSITION                             0x0
#define _CLBDEBUG0_DBG_SIZE                                 0x8
#define _CLBDEBUG0_DBG_LENGTH                               0x8
#define _CLBDEBUG0_DBG_MASK                                 0xFF
#define _CLBDEBUG0_DBG0_POSN                                0x0
#define _CLBDEBUG0_DBG0_POSITION                            0x0
#define _CLBDEBUG0_DBG0_SIZE                                0x1
#define _CLBDEBUG0_DBG0_LENGTH                              0x1
#define _CLBDEBUG0_DBG0_MASK                                0x1
#define _CLBDEBUG0_DBG1_POSN                                0x1
#define _CLBDEBUG0_DBG1_POSITION                            0x1
#define _CLBDEBUG0_DBG1_SIZE                                0x1
#define _CLBDEBUG0_DBG1_LENGTH                              0x1
#define _CLBDEBUG0_DBG1_MASK                                0x2
#define _CLBDEBUG0_DBG2_POSN                                0x2
#define _CLBDEBUG0_DBG2_POSITION                            0x2
#define _CLBDEBUG0_DBG2_SIZE                                0x1
#define _CLBDEBUG0_DBG2_LENGTH                              0x1
#define _CLBDEBUG0_DBG2_MASK                                0x4
#define _CLBDEBUG0_DBG3_POSN                                0x3
#define _CLBDEBUG0_DBG3_POSITION                            0x3
#define _CLBDEBUG0_DBG3_SIZE                                0x1
#define _CLBDEBUG0_DBG3_LENGTH                              0x1
#define _CLBDEBUG0_DBG3_MASK                                0x8
#define _CLBDEBUG0_DBG4_POSN                                0x4
#define _CLBDEBUG0_DBG4_POSITION                            0x4
#define _CLBDEBUG0_DBG4_SIZE                                0x1
#define _CLBDEBUG0_DBG4_LENGTH                              0x1
#define _CLBDEBUG0_DBG4_MASK                                0x10

// Register: PWM2ERS
#define PWM2ERS PWM2ERS
extern volatile unsigned char           PWM2ERS             __at(0x58C);
#ifndef _LIB_BUILD
asm("PWM2ERS equ 058Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ERS                    :8;
    };
    struct {
        unsigned ERS0                   :1;
        unsigned ERS1                   :1;
        unsigned ERS2                   :1;
        unsigned ERS3                   :1;
    };
} PWM2ERSbits_t;
extern volatile PWM2ERSbits_t PWM2ERSbits __at(0x58C);
// bitfield macros
#define _PWM2ERS_ERS_POSN                                   0x0
#define _PWM2ERS_ERS_POSITION                               0x0
#define _PWM2ERS_ERS_SIZE                                   0x8
#define _PWM2ERS_ERS_LENGTH                                 0x8
#define _PWM2ERS_ERS_MASK                                   0xFF
#define _PWM2ERS_ERS0_POSN                                  0x0
#define _PWM2ERS_ERS0_POSITION                              0x0
#define _PWM2ERS_ERS0_SIZE                                  0x1
#define _PWM2ERS_ERS0_LENGTH                                0x1
#define _PWM2ERS_ERS0_MASK                                  0x1
#define _PWM2ERS_ERS1_POSN                                  0x1
#define _PWM2ERS_ERS1_POSITION                              0x1
#define _PWM2ERS_ERS1_SIZE                                  0x1
#define _PWM2ERS_ERS1_LENGTH                                0x1
#define _PWM2ERS_ERS1_MASK                                  0x2
#define _PWM2ERS_ERS2_POSN                                  0x2
#define _PWM2ERS_ERS2_POSITION                              0x2
#define _PWM2ERS_ERS2_SIZE                                  0x1
#define _PWM2ERS_ERS2_LENGTH                                0x1
#define _PWM2ERS_ERS2_MASK                                  0x4
#define _PWM2ERS_ERS3_POSN                                  0x3
#define _PWM2ERS_ERS3_POSITION                              0x3
#define _PWM2ERS_ERS3_SIZE                                  0x1
#define _PWM2ERS_ERS3_LENGTH                                0x1
#define _PWM2ERS_ERS3_MASK                                  0x8

