MikroElektronika/core_packages/PIC/XC8/def/pic/PIC16F13255/mcu.h
extern volatile CLCIN2PPSbits_t CLCIN2PPSbits __at(0x1E3F);
// bitfield macros
#define _CLCIN2PPS_CLCIN2PPS_POSN                           0x0
#define _CLCIN2PPS_CLCIN2PPS_POSITION                       0x0
#define _CLCIN2PPS_CLCIN2PPS_SIZE                           0x7
#define _CLCIN2PPS_CLCIN2PPS_LENGTH                         0x7
#define _CLCIN2PPS_CLCIN2PPS_MASK                           0x7F

// Register: CLCIN3PPS
#define CLCIN3PPS CLCIN3PPS
extern volatile unsigned char           CLCIN3PPS           __at(0x1E40);
#ifndef _LIB_BUILD
asm("CLCIN3PPS equ 01E40h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLCIN3PPS              :7;
    };
} CLCIN3PPSbits_t;
extern volatile CLCIN3PPSbits_t CLCIN3PPSbits __at(0x1E40);
// bitfield macros
#define _CLCIN3PPS_CLCIN3PPS_POSN                           0x0
#define _CLCIN3PPS_CLCIN3PPS_POSITION                       0x0
#define _CLCIN3PPS_CLCIN3PPS_SIZE                           0x7
#define _CLCIN3PPS_CLCIN3PPS_LENGTH                         0x7
#define _CLCIN3PPS_CLCIN3PPS_MASK                           0x7F

// Register: CK1PPS
#define CK1PPS CK1PPS
extern volatile unsigned char           CK1PPS              __at(0x1E41);
#ifndef _LIB_BUILD
asm("CK1PPS equ 01E41h");
#endif
// aliases
extern volatile unsigned char           RX1DTPPS            __at(0x1E41);
#ifndef _LIB_BUILD
asm("RX1DTPPS equ 01E41h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CK1PPS                 :7;
    };
} CK1PPSbits_t;
extern volatile CK1PPSbits_t CK1PPSbits __at(0x1E41);
// bitfield macros
#define _CK1PPS_CK1PPS_POSN                                 0x0
#define _CK1PPS_CK1PPS_POSITION                             0x0
#define _CK1PPS_CK1PPS_SIZE                                 0x7
#define _CK1PPS_CK1PPS_LENGTH                               0x7
#define _CK1PPS_CK1PPS_MASK                                 0x7F
// alias bitfield definitions
typedef union {
    struct {
        unsigned CK1PPS                 :7;
    };
} RX1DTPPSbits_t;
extern volatile RX1DTPPSbits_t RX1DTPPSbits __at(0x1E41);
// bitfield macros
#define _RX1DTPPS_CK1PPS_POSN                               0x0
#define _RX1DTPPS_CK1PPS_POSITION                           0x0
#define _RX1DTPPS_CK1PPS_SIZE                               0x7
#define _RX1DTPPS_CK1PPS_LENGTH                             0x7
#define _RX1DTPPS_CK1PPS_MASK                               0x7F

// Register: RX1PPS
#define RX1PPS RX1PPS
extern volatile unsigned char           RX1PPS              __at(0x1E42);
#ifndef _LIB_BUILD
asm("RX1PPS equ 01E42h");
#endif
// aliases
extern volatile unsigned char           TX1CKPPS            __at(0x1E42);
#ifndef _LIB_BUILD
asm("TX1CKPPS equ 01E42h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RX1PPS                 :7;
    };
} RX1PPSbits_t;
extern volatile RX1PPSbits_t RX1PPSbits __at(0x1E42);
// bitfield macros
#define _RX1PPS_RX1PPS_POSN                                 0x0
#define _RX1PPS_RX1PPS_POSITION                             0x0
#define _RX1PPS_RX1PPS_SIZE                                 0x7
#define _RX1PPS_RX1PPS_LENGTH                               0x7
#define _RX1PPS_RX1PPS_MASK                                 0x7F
// alias bitfield definitions
typedef union {
    struct {
        unsigned RX1PPS                 :7;
    };
} TX1CKPPSbits_t;
extern volatile TX1CKPPSbits_t TX1CKPPSbits __at(0x1E42);
// bitfield macros
#define _TX1CKPPS_RX1PPS_POSN                               0x0
#define _TX1CKPPS_RX1PPS_POSITION                           0x0
#define _TX1CKPPS_RX1PPS_SIZE                               0x7
#define _TX1CKPPS_RX1PPS_LENGTH                             0x7
#define _TX1CKPPS_RX1PPS_MASK                               0x7F

// Register: CK2PPS
#define CK2PPS CK2PPS
extern volatile unsigned char           CK2PPS              __at(0x1E43);
#ifndef _LIB_BUILD
asm("CK2PPS equ 01E43h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CK2PPS                 :7;
    };
} CK2PPSbits_t;
extern volatile CK2PPSbits_t CK2PPSbits __at(0x1E43);
// bitfield macros
#define _CK2PPS_CK2PPS_POSN                                 0x0
#define _CK2PPS_CK2PPS_POSITION                             0x0
#define _CK2PPS_CK2PPS_SIZE                                 0x7
#define _CK2PPS_CK2PPS_LENGTH                               0x7
#define _CK2PPS_CK2PPS_MASK                                 0x7F

// Register: RX2PPS
#define RX2PPS RX2PPS
extern volatile unsigned char           RX2PPS              __at(0x1E44);
#ifndef _LIB_BUILD
asm("RX2PPS equ 01E44h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RX2PPS                 :7;
    };
} RX2PPSbits_t;
extern volatile RX2PPSbits_t RX2PPSbits __at(0x1E44);
// bitfield macros
#define _RX2PPS_RX2PPS_POSN                                 0x0
#define _RX2PPS_RX2PPS_POSITION                             0x0
#define _RX2PPS_RX2PPS_SIZE                                 0x7
#define _RX2PPS_RX2PPS_LENGTH                               0x7
#define _RX2PPS_RX2PPS_MASK                                 0x7F

// Register: SSP1CLKPPS
#define SSP1CLKPPS SSP1CLKPPS
extern volatile unsigned char           SSP1CLKPPS          __at(0x1E47);
#ifndef _LIB_BUILD
asm("SSP1CLKPPS equ 01E47h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSP1CLKPPS             :7;
    };
} SSP1CLKPPSbits_t;
extern volatile SSP1CLKPPSbits_t SSP1CLKPPSbits __at(0x1E47);
// bitfield macros
#define _SSP1CLKPPS_SSP1CLKPPS_POSN                         0x0
#define _SSP1CLKPPS_SSP1CLKPPS_POSITION                     0x0
#define _SSP1CLKPPS_SSP1CLKPPS_SIZE                         0x7
#define _SSP1CLKPPS_SSP1CLKPPS_LENGTH                       0x7
#define _SSP1CLKPPS_SSP1CLKPPS_MASK                         0x7F

// Register: SSP1DATPPS
#define SSP1DATPPS SSP1DATPPS
extern volatile unsigned char           SSP1DATPPS          __at(0x1E48);
#ifndef _LIB_BUILD
asm("SSP1DATPPS equ 01E48h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSP1DATPPS             :7;
    };
} SSP1DATPPSbits_t;
extern volatile SSP1DATPPSbits_t SSP1DATPPSbits __at(0x1E48);
// bitfield macros
#define _SSP1DATPPS_SSP1DATPPS_POSN                         0x0
#define _SSP1DATPPS_SSP1DATPPS_POSITION                     0x0
#define _SSP1DATPPS_SSP1DATPPS_SIZE                         0x7
#define _SSP1DATPPS_SSP1DATPPS_LENGTH                       0x7
#define _SSP1DATPPS_SSP1DATPPS_MASK                         0x7F

// Register: SSP1SSPPS
#define SSP1SSPPS SSP1SSPPS
extern volatile unsigned char           SSP1SSPPS           __at(0x1E49);
#ifndef _LIB_BUILD
asm("SSP1SSPPS equ 01E49h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSP1SSPPS              :7;
    };
} SSP1SSPPSbits_t;
extern volatile SSP1SSPPSbits_t SSP1SSPPSbits __at(0x1E49);
// bitfield macros
#define _SSP1SSPPS_SSP1SSPPS_POSN                           0x0
#define _SSP1SSPPS_SSP1SSPPS_POSITION                       0x0
#define _SSP1SSPPS_SSP1SSPPS_SIZE                           0x7
#define _SSP1SSPPS_SSP1SSPPS_LENGTH                         0x7
#define _SSP1SSPPS_SSP1SSPPS_MASK                           0x7F

// Register: SSP2CLKPPS
#define SSP2CLKPPS SSP2CLKPPS
extern volatile unsigned char           SSP2CLKPPS          __at(0x1E4A);
#ifndef _LIB_BUILD
asm("SSP2CLKPPS equ 01E4Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSP2CLKPPS             :7;
    };
} SSP2CLKPPSbits_t;
extern volatile SSP2CLKPPSbits_t SSP2CLKPPSbits __at(0x1E4A);
// bitfield macros
#define _SSP2CLKPPS_SSP2CLKPPS_POSN                         0x0
#define _SSP2CLKPPS_SSP2CLKPPS_POSITION                     0x0
#define _SSP2CLKPPS_SSP2CLKPPS_SIZE                         0x7
#define _SSP2CLKPPS_SSP2CLKPPS_LENGTH                       0x7
#define _SSP2CLKPPS_SSP2CLKPPS_MASK                         0x7F

// Register: SSP2DATPPS
#define SSP2DATPPS SSP2DATPPS
extern volatile unsigned char           SSP2DATPPS          __at(0x1E4B);
#ifndef _LIB_BUILD
asm("SSP2DATPPS equ 01E4Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSP2DATPPS             :7;
    };
} SSP2DATPPSbits_t;
